appengines/app/Controllers/Auth.php

  public function act()
  {
    helper('form');
    $session = session();
    $model = new AuthModel();
    $modelRoles = new MyModel('roles');

    $username = $this->request->getPost('usr');
    $password = $this->request->getPost('pwd');
    $data = $model->where('username', $username)->first();
    if ($data) {
      $hash = $data['password'];
      $verify_pass = password_verify($password, $hash);
      if ($verify_pass) {
        if ($data['status_user'] == 1) {
          date_default_timezone_set('Asia/Singapore');
          $datenow = date('Y-m-d H:i:s');
          $model->update(array('id_user' => $data['id_user']), array('last_login' => $datenow));
---
UPDATE `users` SET `last_login` = '2025-08-11 22:28:03'
WHERE `users`.`id_user` IN ('11')