appengines/app/Models/AuthModel.php

	public function getMenu($role)
	{
		$db = \Config\Database::connect();
        $builder = $db->table('menus a');
        $builder->select('a.*, b.role_id, b.status_otoritas');
        $builder->join('otoritas b', 'a.kode_menu=b.kode_menu');
        $builder->where('role_id', $role);
        $builder->where('status_otoritas', 1);
        $builder->orderBy('a.sort_order', 'asc');
		return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`role_id`, `b`.`status_otoritas`
FROM `menus` `a`
JOIN `otoritas` `b` ON `a`.`kode_menu`=`b`.`kode_menu`
WHERE `role_id` = '2'
AND `status_otoritas` = 1
ORDER BY `a`.`kode_menu` ASC